<a href="https://colab.research.google.com/github/AbderrhmanAbdellatif/CRM/blob/master/Predicting_Next_Purchase_Day.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Predictive analytics helps us a lot on this one. One of the many opportunities it can provide is predicting the next purchase day of the customer. What if you know if a customer is likely to make another purchase in 7 days?

##We can build our strategy on top of that and come up with lots of tactical actions like:

1-No promotional offer to this customer since s/he will make a purchase anyways

2-Nudge the customer with inbound marketing if there is no purchase in the predicted time window (or fire the guy who did the prediction ü¶π‚Äç‚ôÄÔ∏è ü¶π‚Äç‚ôÇÔ∏è )

## we will be using online retail dataset and follow the steps below:

    Data Wrangling (creating previous/next datasets and calculate purchase day differences)
    Feature Engineering
    Selecting a Machine Learning Model
    Multi-Classification Model
    Hyperparameter Tuning

In [0]:
#import libraries
from datetime import datetime, timedelta,date
import pandas as pd
%matplotlib inline
from sklearn.metrics import classification_report,confusion_matrix
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from __future__ import division
from sklearn.cluster import KMeans

#do not show warnings
import warnings
warnings.filterwarnings("ignore")

#import plotly for visualization
import chart_studio.plotly as py
import plotly.graph_objs as go
import plotly.offline as pyoff
import plotly.graph_objs as go

#import machine learning related libraries
from sklearn.svm import SVC
from sklearn.multioutput import MultiOutputClassifier
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
import xgboost as xgb
from sklearn.model_selection import KFold, cross_val_score, train_test_split

#initiate plotly
pyoff.init_notebook_mode()

#import the csv
tx_data = pd.read_csv('https://raw.githubusercontent.com/AbderrhmanAbdellatif/CRM/master/OnlineRetail.csv',encoding= 'unicode_escape')

#print first 10 rows
tx_data.head(10)

#convert date field from string to datetime
tx_data['InvoiceDate'] = pd.to_datetime(tx_data['InvoiceDate'])

#create dataframe with uk data only
tx_uk = tx_data.query("Country=='United Kingdom'").reset_index(drop=True)

In [11]:
tx_uk.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

We use six months of behavioral data to predict customers‚Äô first purchase date in the next three months. If there is no purchase, we will predict that too. Let‚Äôs assume our cut off date is Sep 9th ‚Äô11 and split the data:

In [0]:
tx_6m = tx_uk[(tx_uk.InvoiceDate < date(2011,9,1)) & (tx_uk.InvoiceDate >= date(2011,3,1))].reset_index(drop=True)

In [15]:
tx_6m.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    545220     21955  ...    14620.0  United Kingdom
1    545220     48194  ...    14620.0  United Kingdom
2    545220     22556  ...    14620.0  United Kingdom
3    545220     22139  ...    14620.0  United Kingdom
4    545220    84029G  ...    14620.0  United Kingdom

[5 rows x 8 columns]

In [0]:
tx_next = tx_uk[(tx_uk.InvoiceDate >= date(2011,9,1)) & (tx_uk.InvoiceDate < date(2011,12,1))].reset_index(drop=True)

In [17]:
tx_next.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    565080     20677  ...    13509.0  United Kingdom
1    565080     22128  ...    13509.0  United Kingdom
2    565081     21067  ...        NaN  United Kingdom
3    565082     22423  ...    13305.0  United Kingdom
4    565082    15060B  ...    13305.0  United Kingdom

[5 rows x 8 columns]

 we will create a dataframe called tx_user to possess a user-level feature set for the prediction model:

In [0]:
tx_user = pd.DataFrame(tx_6m['CustomerID'].unique())
tx_user.columns = ['CustomerID']

In [20]:
tx_user.head()

   CustomerID
0     14620.0
1     14740.0
2     13880.0
3     16462.0
4     17068.0

#create a dataframe with customer id and first purchase date in tx_next